public class CharactersContainers {
    public static final String[] ASSAME_CHARACTERS = {
            "অ", "আ", "ই", "ঈ", "উ", "ঊ", "ঋ", "এ", "ঐ", "ও", "ঔ", "ক", "খ", "গ", "ঘ", "ঙ",
            "চ", "ছ", "জ", "ঝ", "ঞ", "ট", "ঠ", "ড", "ঢ", "ণ", "ত", "থ", "দ", "ধ", "ন", "প", "ফ",
            "ব", "ভ", "ম", "য", "র", "ল", "শ", "ষ", "স", "হ", "ড়", "ঢ়", "য়", "ৎ", "ং", "ঃ", "অঁ",
            "১", "২", "৩", "৪", "৫", "৬", "৭", "৮", "৯", "০"
    };

    public static final String[] CHHATTISGARHI_CHARACTERS = {
            "अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ए", "ऐ", "ओ", "औ", "अं", "अः", "क", "ख", "ग", "घ", "ङ",
            "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न", "प", "फ", "ब", "भ",
            "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "ॐ", "ळ", "॥", "१", "२", "३", "४", "५", "६", "७",
            "८", "९", "०"
    };

    public static final String[] GUJARATI_CHARACTERS = {
            "અ", "આ", "ઇ", "ઈ", "ઉ", "ઊ", "ઋ", "ૠ", "ઌ", "ૡ", "એ", "ઐ", "ઓ", "ઔ", "અં", "અઃ", "ક", "ખ",
            "ગ", "ઘ", "ઙ", "ચ", "છ", "જ", "ઝ", "ઞ", "ટ", "ઠ", "ડ", "ઢ", "ણ", "ત", "થ", "દ", "ધ", "ન",
            "પ", "ફ", "બ", "ભ", "મ", "ય", "ર", "લ", "વ", "શ", "ષ", "સ", "હ", "ળ", "૞", "૧", "૨", "૩",
            "૪", "૫", "૬", "૭", "૮", "૯", "૦"
    };

    public static final String[] HINDI_CHARACTERS = {
            "अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ॠ", "ऌ", "ॡ", "ए", "ऐ", "ओ", "औ", "अं", "अः", "क", "ख", "ग", "घ", "ङ",
            "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न", "प", "फ", "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "ॐ", "ऽ", "ळ", "क्ष", "ज्ञ", "॥",
            "१", "२", "३", "४", "५", "६", "७", "८", "९", "०", "।", "‘", "’", "“", "”", "।", "॥", "ॲ", "ॳ", "ॴ", "ॵ", "ॶ", "ॷ", "ॸ", "ॹ", "ॺ", "ॻ", "ॼ", "ॽ", "ॾ", "ॿ"
    };

    public static final String[] KANNADA_CHARACTERS = {
            "ಅ", "ಆ", "ಇ", "ಈ", "ಉ", "ಊ", "ಋ", "ೠ", "ಌ", "ೡ", "ಎ", "ಏ", "ಐ", "ಒ", "ಓ", "ಔ", "ಕ", "ಖ",
            "ಗ", "ಘ", "ಙ", "ಚ", "ಛ", "ಜ", "ಝ", "ಞ", "ಟ", "ಠ", "ಡ", "ಢ", "ಣ", "ತ", "ಥ", "ದ", "ಧ", "ನ",
            "ಪ", "ಫ", "ಬ", "ಭ", "ಮ", "ಯ", "ರ", "ಱ", "ಲ", "ವ", "ಶ", "ಷ", "ಸ", "ಹ", "ಳ", "ೞ", "೧", "೨",
            "೩", "೪", "೫", "೬", "೭", "೮", "೯", "೦"
    };

    public static final String[] KONKANI_CHARACTERS = {
            "अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ए", "ऐ", "ओ", "औ", "अं", "अः", "क", "ख", "ग", "घ", "ङ",
            "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "।", "त", "थ", "द", "ध", "न", "प", "फ",
            "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "ॐ", "ळ", "॥", "१", "२", "३", "४",
            "५", "६", "७", "८", "९", "०"
    };

    public static final String[] MALAYALAM_CHARACTERS = {
            "അ", "ആ", "ഇ", "ഈ", "ഉ", "ഉ", "ഋ", "ൠ", "ഌ", "ൡ", "എ", "ഏ", "ഒ", "ഓ", "ഐ", "ഔ",
            "ാ", "ി", "ീ", "ു", "ൂ", "ൃ", "ൄ", "ൢ", "ൣ", "െ", "േ", "ൈ", "ൊ", "ോ", "ൌ",
            "ക", "ഖ", "ഗ", "ഘ", "ങ", "ച", "ഛ", "ജ", "ഝ", "ഞ", "ട", "ഠ", "ഡ", "ഢ", "ണ", "ത", "ഥ", "ദ", "ധ", "ന", "ഩ", "പ", "ഫ", "ബ", "ഭ", "മ", "യ", "ര", "റ", "ല", "ള", "ഴ", "വ", "ശ", "ഷ", "സ", "ഹ", "ഺ",
            "൦", "൧", "൨", "൩", "൪", "൫", "൬", "൭", "൮", "൯",
            ".", ",", "。", "॥", "ഽ", "൹"
    };

    public static final String[] MARATHI_CHARACTERS = {
            "अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ए", "ऐ", "ओ", "औ", "अं", "अः", "क", "ख", "ग", "घ", "ङ",
            "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "।", "त", "थ", "द", "ध", "न", "प", "फ",
            "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "ॐ", "ळ", "॥", "१", "२", "३", "४",
            "५", "६", "७", "८", "९", "०"
    };

    public static final String[] ORIYA_CHARACTERS = {
            "ଅ", "ଆ", "ଇ", "ୀ", "ଉ", "ଊ", "ଋ", "ୠ", "ଌ", "ୡ", "ଏ", "ଐ", "ଓ", "ଔ", "ଅଂ", "ଅଃ", "କ", "ଖ",
            "ଗ", "ଘ", "ଙ", "ଚ", "ଛ", "ଜ", "ଝ", "ଞ", "ଟ", "ଠ", "ଡ", "ଢ", "ଣ", "ତ", "ଥ", "ଦ", "ଧ", "ନ",
            "ପ", "ଫ", "ବ", "ଭ", "ମ", "ଯ", "ର", "ଲ", "ଵ", "ଶ", "ଷ", "ସ", "ହ", "ଳ", "୞", "୧", "୨", "୩",
            "୪", "୫", "୬", "୭", "୮", "୯", "୦"
    };

    public static final String[] PUNJABI_CHARACTERS = {
            "ਅ", "ਆ", "ਇ", "ਈ", "ਉ", "ਊ", "ਏ", "ਐ", "ਓ", "ਔ", // Vowels
            "ਅ", "ਆ", "ਇ", "ਈ", "ਉ", "ਊ", "ਏ", "ਐ", "ਓ", "ਔ", // Vowels (Romanized)
            "ਕ", "ਖ", "ਗ", "ਘ", "ਙ", // Consonants
            "k", "kh", "g", "gh", "ṅ", // Consonants (Romanized)
            "ਚ", "ਛ", "ਜ", "ਝ", "ਞ", // Consonants (c, ch, j, jh, ñ)
            "c", "ch", "j", "jh", "ñ"  // Consonants (Romanized)
    };


    public static final String[] SANSKRIT_CHARACTERS = {
            "अ", "आ", "इ", "ई", "उ", "ऊ", "ऋ", "ए", "ऐ", "ओ", "औ", "अं", "अः", "क", "ख", "ग", "घ", "ङ",
            "च", "छ", "ज", "झ", "ञ", "ट", "ठ", "ड", "ढ", "ण", "।", "त", "थ", "द", "ध", "न", "प", "फ",
            "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह", "ॐ", "ऽ", "ळ", "॥", "१", "२", "३",
            "४", "५", "६", "७", "८", "९", "०"
    };

    public static final String[] TAMIL_CHARACTERS = {
            // Independent Vowels
            "அ", "ஆ", "இ", "ஈ", "உ", "ஊ", "எ", "ஏ", "ஐ", "ஒ", "ஓ", "ஔ",

            // Dependent Vowels
            "ா", "ி", "ீ", "ு", "ூ", "ெ", "ே", "ை",

            // Two Part Dependent Vowels
            "ொ", "ோ", "ௌ",

            // Tamil Consonants (Meyyeḻuttu)
            "க", "ங", "ச", "ஜ", "ஞ", "ட", "ண", "த", "ந", "ன", "ப", "ம", "ய",
            "ர", "ற", "ல", "ள", "ழ", "வ", "ஶ", "ஷ", "ஸ", "ஹ",

            // Tamil Digits
            "௦", "௧", "௨", "௩", "௪", "௫", "௬", "௭", "௮", "௯",

            // Tamil Numerics
            "௰", "௱", "௲",

            // Tamil Special Character Letters
            ".", ",", "ஃ", "்", "।", "॥", "ௐ", "ௗ"
    };

    public static final String[] TELUGU_CHARACTERS = {
            "అ", "ఆ", "ఇ", "ఈ", "ఉ", "ఊ", "ఋ", "ౠ", "ఌ", "ౡ", "ఎ", "ఐ", "ఓ", "ఔ", "అం", "అః", "క",
            "ఖ", "గ", "ఘ", "ఙ", "చ", "ఛ", "జ", "ఝ", "ఞ", "ట", "ఠ", "డ", "ఢ", "ణ", "త", "థ", "ద", "ధ",
            "న", "ప", "ఫ", "బ", "భ", "మ", "య", "ర", "ల", "వ", "శ", "ష", "స", "హ", "ళ", "౞", "౧", "౨",
            "౩", "౪", "౫", "౬", "౭", "౮", "౯", "౦"
    };

    public static final String[] URDU_CHARACTERS = {
            "ا", "ب", "پ", "ت", "ٹ", "ث", "ج", "چ", "ح", "خ", "د", "ڈ", "ذ", "ر", "ڑ", "ز", "ژ", "س",
            "ش", "ص", "ض", "ط", "ظ", "ع", "غ", "ف", "ق", "ک", "گ", "ل", "م", "ن", "ں", "و", "ہ", "ھ",
            "ء", "ی", "ے", "١", "٢", "٣", "٤", "٥", "٦", "٧", "٨", "٩", "٠"
    };

    public static final String[] ENGLISH_CHARACTERS = {
            "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R",
            "S", "T", "U", "V", "W", "X", "Y", "Z", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j",
            "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "1", "2",
            "3", "4", "5", "6", "7", "8", "9", "0"
    };

    public static String[][] CHARACTER_2D_ARRAY = {
            ASSAME_CHARACTERS,
            CHHATTISGARHI_CHARACTERS,
            GUJARATI_CHARACTERS,
            HINDI_CHARACTERS,
            KANNADA_CHARACTERS,
            KONKANI_CHARACTERS,
            MALAYALAM_CHARACTERS,
            MARATHI_CHARACTERS,
            ORIYA_CHARACTERS,
            PUNJABI_CHARACTERS,
            SANSKRIT_CHARACTERS,
            TAMIL_CHARACTERS,
            TELUGU_CHARACTERS,
            URDU_CHARACTERS,
            ENGLISH_CHARACTERS
    };
    public static String[] CHARACTER_ARRAY_NAMES = {
            "ASSAME_CHARACTERS",
            "CHHATTISGARHI_CHARACTERS",
            "GUJARATI_CHARACTERS",
            "HINDI_CHARACTERS",
            "KANNADA_CHARACTERS",
            "KONKANI_CHARACTERS",
            "MALAYALAM_CHARACTERS",
            "MARATHI_CHARACTERS",
            "ORIYA_CHARACTERS",
            "PUNJABI_CHARACTERS",
            "SANSKRIT_CHARACTERS",
            "TAMIL_CHARACTERS",
            "TELUGU_CHARACTERS",
            "URDU_CHARACTERS",
            "ENGLISH_CHARACTERS"
    };

}
